system/blockMeshDict
FoamFile
{
  version 2.0;
  format  ascii;
  class   dictionary;
  object  blockMeshDict;
}
vertices
(
  (-0.8250000000000001 -0.525 -3.3099999999999996)
  (13.325000000000001 -0.525 -3.3099999999999996)
  (13.325000000000001 4.575 -3.3099999999999996)
  (-0.8250000000000001 4.575 -3.3099999999999996)
  (-0.8250000000000001 -0.525 1.925)
  (13.325000000000001 -0.525 1.925)
  (13.325000000000001 4.575 1.925)
  (-0.8250000000000001 4.575 1.925)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (43 16 16) simpleGrading (1 1 1)
);
edges ();
patches ();
mergePatchPairs ();
