0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.047;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    concreteWall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    pipe1
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    pipe2
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    pipe3
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    difusor1
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    difusor2
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
	excesos
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    ".*"
    {
        type            inletOutlet;
        inletValue		$internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
