0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.0092;

boundaryField
{
    concreteWall
    {
        type            nutkWallFunction; //nutkRoughWallFunction
        value           uniform 0.0092;
    }
    difusor1
    {
        type            nutkWallFunction;
        value           uniform 0.0092;
    }
    difusor2
    {
        type            nutkWallFunction;
        value           uniform 0.0092;
    }
    pipe1
    {
        type            nutkWallFunction;
        value           uniform 0.0092;
    }
    pipe2
    {
        type            nutkWallFunction;
        value           uniform 0.0092;
    }
    pipe3
    {
        type            nutkWallFunction;
        value           uniform 0.0092;
    }
    excesos
    {
        type            nutkWallFunction;
        value           uniform 0.0092;
    }
    ".*"
    {
        type            calculated;
        value           uniform 0;
    }

}


// ************************************************************************* //
