system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("desarenador.stl" "inlet.stl" "outlet1.stl" "outlet2.stl" "outlet_princi.stl" "difusor1.stl" "difusor2.stl" "pipe1.stl" "pipe2.stl" "pipe3.stl" "excesos.stl"  "concreteWall.stl" "atmosphere.stl");

// Identify a feature when angle between faces < includedAngle
includedAngle   150; //30

// ************************************************************************* //
